pressure_tests_results/wo_redis_largeFile_1GB_1.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 2 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 2 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 2 VUs  0m01.0s/2m0s

running (0m02.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 2 VUs  0m02.0s/2m0s

running (0m03.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 2 VUs  0m03.0s/2m0s

running (0m09.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 2 VUs  0m09.0s/2m0s

running (0m10.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 2 VUs  0m10.0s/2m0s

running (0m11.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 2 VUs  0m11.0s/2m0s

running (0m12.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  0m12.0s/2m0s

running (0m13.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  11% ] 2 VUs  0m13.0s/2m0s

running (0m14.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m14.0s/2m0s

running (0m15.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m15.0s/2m0s

running (0m16.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  13% ] 2 VUs  0m16.0s/2m0s

running (0m17.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  14% ] 2 VUs  0m17.0s/2m0s

running (0m18.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  15% ] 2 VUs  0m18.0s/2m0s

running (0m19.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  16% ] 2 VUs  0m19.0s/2m0s

running (0m20.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  0m20.0s/2m0s

running (0m21.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  18% ] 2 VUs  0m21.0s/2m0s

running (0m22.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  18% ] 2 VUs  0m22.0s/2m0s

running (0m23.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  19% ] 2 VUs  0m23.0s/2m0s

running (0m24.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  0m24.0s/2m0s

running (0m25.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  21% ] 2 VUs  0m25.0s/2m0s

running (0m26.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m26.0s/2m0s

running (0m27.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m27.0s/2m0s

running (0m28.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  23% ] 2 VUs  0m28.0s/2m0s

running (0m29.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  24% ] 2 VUs  0m29.0s/2m0s

running (0m30.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [  25% ] 2 VUs  0m30.0s/2m0s

running (0m31.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [  26% ] 2 VUs  0m31.0s/2m0s

running (0m32.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  0m32.0s/2m0s

running (0m33.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  28% ] 2 VUs  0m33.0s/2m0s

running (0m34.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  28% ] 2 VUs  0m34.0s/2m0s

running (0m35.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  29% ] 2 VUs  0m35.0s/2m0s

running (0m36.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  0m36.0s/2m0s

running (0m37.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  31% ] 2 VUs  0m37.0s/2m0s

running (0m38.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m38.0s/2m0s

running (0m39.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m39.0s/2m0s

running (0m40.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  0m40.0s/2m0s

running (0m41.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  34% ] 2 VUs  0m41.0s/2m0s

running (0m42.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  35% ] 2 VUs  0m42.0s/2m0s

running (0m43.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  36% ] 2 VUs  0m43.0s/2m0s

running (0m44.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m44.0s/2m0s

running (0m45.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m45.0s/2m0s

running (0m46.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  38% ] 2 VUs  0m46.0s/2m0s

running (0m47.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  39% ] 2 VUs  0m47.0s/2m0s

running (0m48.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  0m48.0s/2m0s

running (0m49.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  41% ] 2 VUs  0m49.0s/2m0s

running (0m50.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m50.0s/2m0s

running (0m51.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m51.0s/2m0s

running (0m52.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  43% ] 2 VUs  0m52.0s/2m0s

running (0m53.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  44% ] 2 VUs  0m53.0s/2m0s

running (0m54.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
default   [  45% ] 2 VUs  0m54.0s/2m0s

running (0m55.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  46% ] 2 VUs  0m55.0s/2m0s

running (0m56.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m56.0s/2m0s

running (0m57.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m57.0s/2m0s

running (0m58.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  48% ] 2 VUs  0m58.0s/2m0s

running (0m59.1s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  49% ] 2 VUs  0m59.1s/2m0s

running (1m00.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  1m00.0s/2m0s

running (1m01.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
default   [  51% ] 2 VUs  1m01.0s/2m0s

running (1m02.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m02.0s/2m0s

running (1m03.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m03.0s/2m0s

running (1m04.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  53% ] 2 VUs  1m04.0s/2m0s

running (1m05.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  54% ] 2 VUs  1m05.0s/2m0s

running (1m06.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  55% ] 2 VUs  1m06.0s/2m0s

running (1m07.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  56% ] 2 VUs  1m07.0s/2m0s

running (1m08.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  1m08.0s/2m0s

running (1m09.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  58% ] 2 VUs  1m09.0s/2m0s

running (1m10.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  58% ] 2 VUs  1m10.0s/2m0s

running (1m11.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  59% ] 2 VUs  1m11.0s/2m0s

running (1m12.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  1m12.0s/2m0s

running (1m13.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  61% ] 2 VUs  1m13.0s/2m0s

running (1m14.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m14.0s/2m0s

running (1m15.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m15.0s/2m0s

running (1m16.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  63% ] 2 VUs  1m16.0s/2m0s

running (1m17.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  64% ] 2 VUs  1m17.0s/2m0s

running (1m18.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  65% ] 2 VUs  1m18.0s/2m0s

running (1m19.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  66% ] 2 VUs  1m19.0s/2m0s

running (1m20.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m20.0s/2m0s

running (1m21.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m21.0s/2m0s

running (1m22.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  68% ] 2 VUs  1m22.0s/2m0s

running (1m23.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  69% ] 2 VUs  1m23.0s/2m0s

running (1m24.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  1m24.0s/2m0s

running (1m25.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  71% ] 2 VUs  1m25.0s/2m0s

running (1m26.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m26.0s/2m0s

running (1m27.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m27.0s/2m0s

running (1m28.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  73% ] 2 VUs  1m28.0s/2m0s

running (1m29.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  74% ] 2 VUs  1m29.0s/2m0s

running (1m30.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  75% ] 2 VUs  1m30.0s/2m0s

running (1m31.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  76% ] 2 VUs  1m31.0s/2m0s

running (1m32.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  1m32.0s/2m0s

running (1m33.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  78% ] 2 VUs  1m33.0s/2m0s

running (1m34.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  78% ] 2 VUs  1m34.0s/2m0s

running (1m35.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  79% ] 2 VUs  1m35.0s/2m0s

running (1m36.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  1m36.0s/2m0s

running (1m37.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  81% ] 2 VUs  1m37.0s/2m0s

running (1m38.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m38.0s/2m0s

running (1m39.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m39.0s/2m0s

running (1m40.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  83% ] 2 VUs  1m40.0s/2m0s

running (1m41.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  84% ] 2 VUs  1m41.0s/2m0s

running (1m42.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  85% ] 2 VUs  1m42.0s/2m0s

running (1m43.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  86% ] 2 VUs  1m43.0s/2m0s

running (1m44.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m44.0s/2m0s

running (1m45.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m45.0s/2m0s

running (1m46.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  88% ] 2 VUs  1m46.0s/2m0s

running (1m47.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  89% ] 2 VUs  1m47.0s/2m0s

running (1m48.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  1m48.0s/2m0s

running (1m49.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  91% ] 2 VUs  1m49.0s/2m0s

running (1m50.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m50.0s/2m0s

running (1m51.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m51.0s/2m0s

running (1m52.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  93% ] 2 VUs  1m52.0s/2m0s

running (1m53.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  94% ] 2 VUs  1m53.0s/2m0s

running (1m54.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  95% ] 2 VUs  1m54.0s/2m0s

running (1m55.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  96% ] 2 VUs  1m55.0s/2m0s

running (1m56.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m56.0s/2m0s

running (1m57.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m57.0s/2m0s

running (1m58.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  98% ] 2 VUs  1m58.0s/2m0s

running (1m59.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  99% ] 2 VUs  1m59.0s/2m0s

running (2m00.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  2m0s

running (2m01.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m02.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m03.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m04.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m05.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m06.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m07.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m08.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m09.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m10.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m11.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m12.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m13.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m14.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m15.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m16.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m19.7s), 2/2 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m20.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m21.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m22.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m23.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m24.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m25.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m26.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m27.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m28.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m29.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m30.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s

running (2m30.6s), 0/2 VUs, 15 complete and 1 interrupted iterations
default ✓ [ 100% ] 2 VUs  2m0s

     data_received..................: 17 GB  114 MB/s
     data_sent......................: 1.9 kB 12 B/s
     http_req_blocked...............: avg=8.4ms   min=8µs   med=2.03ms max=43.16ms  p(90)=29.01ms p(95)=41.75ms
     http_req_connecting............: avg=1.53ms  min=0s    med=448µs  max=5.74ms   p(90)=5.27ms  p(95)=5.73ms 
     http_req_duration..............: avg=15.81s  min=1.31s med=15.48s max=46.79s   p(90)=23.53s  p(95)=30.53s 
       { expected_response:true }...: avg=15.81s  min=1.31s med=15.48s max=46.79s   p(90)=23.53s  p(95)=30.53s 
     http_req_failed................: 0.00%  ✓ 0        ✗ 15 
     http_req_receiving.............: avg=15.78s  min=1.3s  med=15.33s max=46.78s   p(90)=23.46s  p(95)=30.48s 
     http_req_sending...............: avg=3.73ms  min=13µs  med=794µs  max=26.47ms  p(90)=10.37ms p(95)=17.66ms
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s     max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=31.12ms min=844µs med=9.54ms max=124.83ms p(90)=70.48ms p(95)=90.73ms
     http_reqs......................: 15     0.099579/s
     iteration_duration.............: avg=16.4s   min=1.89s med=15.65s max=46.91s   p(90)=23.73s  p(95)=30.76s 
     iterations.....................: 15     0.099579/s
     vus............................: 1      min=1      max=2
     vus_max........................: 2      min=2      max=2